[{"title": "Need a Cosplay Idea", "text": "So i've been to a lot of conventions but have never cosplayed it one. I just want a cosplay that would be relatively easy to make but isn't some mainstream character that everyone cosplays (Lookin' at you Kirito).\nThanks in advance.", "date": "2017-01-23", "comments": [{"text": "MEGUMIN\n\nEKISUPUROOOOOSIAN", "date": "2017-01-23"}, {"text": "Kazuma. He is so hot right now.\n\nAnd one of the easiest to cosplay.", "date": "2017-01-23"}]}, {"title": "Need new anime.", "text": "As the title suggests I'm in need of more anime. Here are a little of the things I've watched: https://myanimelist.net/animelist/Mafia-?status=2 These are just some of things I've watched as I always forget to add everything. I've been in a Magic/supernatural powers mood lately. Any suggestions?", "date": "2017-01-23", "comments": []}, {"title": "What was your favourite opening song in 2016?", "text": "Mine was the opening for All Out!!", "date": "2017-01-23", "comments": [{"text": "Probably Mob", "date": "2017-01-23"}, {"text": "Shakunetsu Switch", "date": "2017-01-23"}, {"text": "[COOLEST](https://my.mixtape.moe/jocjng.webm) from Sakamoto Desu ga\n\nI love that OP.", "date": "2017-01-23"}, {"text": "As much as the anime itself disappointed me, the [Berserk 2016](https://www.youtube.com/watch?v=cDbctEO2qjQ) opening was so amazing. 9mm Parabellum Bullet did such a great job. If only they did a full version...", "date": "2017-01-23"}, {"text": "Why not a Top 5?\n\n* [Twin Star Exorcists OP2](https://my.mixtape.moe/awsiwv.webm)\n* [Amanchu!](https://my.mixtape.moe/ecsnej.webm)\n* [Scorching Ping Pong Girls](https://a.fluntcaps.me/jnjexl.webm)\n* [Flip Flappers](https://my.mixtape.moe/sktvrc.webm)\n* [Flying Witch](https://my.mixtape.moe/mdfnsy.webm)", "date": "2017-01-23"}, {"text": "This is hard for me, the two that I enjoyed listening to the most were the OPs from [New Game!](https://youtu.be/dBwwipunJcw) and [Scorching Ping Pong Girls.](https://myanimelist.net/anime/33031/Shakunetsu_no_Takkyuu_Musume) I can't pick between those two though.", "date": "2017-01-23"}, {"text": "Usurai Shinjuu (Rakugo's opening)", "date": "2017-01-23"}, {"text": "Dagashi Kashi OP", "date": "2017-01-23"}, {"text": "Definitely [Great Days](https://www.youtube.com/watch?v=WDixSUFj7Qw) from JoJo's Bizarre Adventure: Diamond is Unbreakable.", "date": "2017-01-23"}, {"text": "History Maker - Yuri On Ice", "date": "2017-01-23"}, {"text": "[Well here is the entire list of openings from 2016](https://www.reddit.com/r/animethemes/wiki/2016#wiki_2016_winter_season_.281st_quarter.29)\n\n[Kiznaiver](https://my.mixtape.moe/duejvp.webm) btw is my answer.", "date": "2017-01-23"}, {"text": "Redo from Re:Zero but there were a lot of killer openings in 2016. 2017 is shaping up nicely as well.", "date": "2017-01-23"}, {"text": "I'll go for the unconventional response and say [Occultic;Nine](https://track4.mixtape.moe/ljuqys.webm). \n\nWorthy of being analyzed by Mother's Basement. Loads of great visuals, hidden-in-plain sight plot details, and integrates the text in the OP in clever ways. ", "date": "2017-01-23"}, {"text": "[Rakugo](https://track3.mixtape.moe/iianfk.webm), because of the sex voice and the jazz. ", "date": "2017-01-23"}, {"text": "Great days from JoJo and Re:Re from Erased were my two favorites. ", "date": "2017-01-23"}]}, {"title": "English Dub vs. Sub. Why is Sub accepted more than Dub?", "text": "I've always been interested in why people like sub more than dub. There will be times when I'm watching different anime with people and they always insist on watching the anime series in sub. I personally am willing to watch either dub or sub indiscriminately but I prefer dub sometimes because I don't have to keep looking down at the words I'm reading and trying desperately to match them with the sounds coming out of the characters mouth. I would like to see your many reasons on why you watch dub over sub or vice versa.", "date": "2017-01-23", "comments": [{"text": "* VA ability: A-list Japanese VAs vs. Not A-List English VAs\n\n* Subs come out way quicker\n\n* Subs are more \"authentic\" than dubbing and you may miss out on some word plays and whatnot. Also some shows that depend on word play will be just destroyed if they are dubbed.", "date": "2017-01-23"}, {"text": "The English VA's usually don't compare to the japanese\n\nUsually the voices in dub don't fit\n\nThe dub a lot of times is legit shitty like Clannad\n\nMost shows are just way better in sub, try watching Clannad subbed and then go watch the dub for a comparison, the difference is ridiculous", "date": "2017-01-23"}, {"text": "I like subbed because the voice acting is generally better and save for a few cases like Baccano or 91 Days it sounds more natural due to the setting. Judging people for preferring dubbed is stupid though and there are a few dubs I really like.", "date": "2017-01-23"}, {"text": "Because dubs take more time to produce meaning i have to wait longer.\n\nBecause there was a long period where dubs were done with shitty voice acting that wasnt half as good as what western cartoons in the same era would get (Lookin' at you, Akira.)\n\nBecause Japanese VAs still tend to put more effort into their work than western vas for anime.\n\nBecause it gets me closer to the original meanings. For the conversations to flow well, sometimes lines have to be changed in dubs. Something can read odd but not sound odd. \n\nIt helps that i had several years in choir, learning how to listen to and put emotion into languages i don't know.", "date": "2017-01-23"}, {"text": "I have a friend who is very stingy on the way the characters lips move with the dialogue, not to mention that sometimes there are some restrictions on the translation from Japanese to English. It really depends for me, sometimes I need to look away from the screen and if I'm watching a sub I have to pause it so I don't miss anything important. I understand why someone would want to watch a sub, but dubs are just way more convenient. Although a newer anime will have subs before dubs, so there's that.", "date": "2017-01-23"}, {"text": "Because you are on a board where people are into the content.\n\nDubs are for mainstream appeal.", "date": "2017-01-23"}, {"text": "Some shows I prefer the dub of but usually I prefer the sub. I used to be in the dub only group but one day I started legitimately giving subs a chance and was hooked on the quality difference.", "date": "2017-01-23"}, {"text": "These are my personal reasons, a few of which I'm sure others share:\n\n1) I prefer watching and even reading when possible in the language the creators originally made it in. Some things are too culturally tied for translations to keep the essence of what people are saying.\n\n2) The voices just don't fit either the visuals. An example of the former is how all high school males in anime seemed to be voiced by a guy who sounds like he's in his 30s/40s whereas Japanese VAs, despite their age, can produce higher pitched voices that sound like school kids. Yuki Kaji is a good example of a VA that does this.\n\n3) English dubs are always done in an American accent and so just don't fit the setting most of the time. An example of the latter is Zen from Akagami no Shirayuki-hime. The setting is very European-inspired yet the dub of Zen makes him sound like a Californian surfer dude and not a prince brought up in aristocracy. The Japanese VAs seem to be much better at sounding more demure.", "date": "2017-01-23"}, {"text": "Mentioned this elsewhere, but on top of having a bigger pool of VAs to pick from (thus a higher percentage of works with good acting), dubs are inherently difficult to do well, regardless of language. Look up the Japanese dub of RWBY. English comments mention liking it in English better.  And they have Saori Hayami voicing Ruby! And if you look at the rest of the cast, you'd notice that they go with more experienced VAs for dubbing - the rest of the cast are mostly known names as well.", "date": "2017-01-23"}]}, {"title": "Need help guys (SPOILER) for toradora ep 7", "text": "(SPOILER) \nDoes anyone know the name of this song on toradora ep7  at 18:50 when taiga starts drowning, I've been searching for three days straight and nothing", "date": "2017-01-23", "comments": []}, {"title": "What is the most pointless conversation relating to an anime you've ever had?", "text": "For me, it would be when I was trying to convince my friend of all of SAO's flaws. Not to get him to *hate* SAO, mind you, but just to get him to *acknowledge* that it's a flawed show.\n\n...until I found out that he's absolutely enamored in Kirito because he's a bland MC who gets girls for no reason other than him being OP. He refuses to watch other anime that have competent characters (his reasoning is that the supporting cast is supposed to \"suck the main character's dick because he is the main character\").\n\n(...or it could also just be a pointless argument, like who best girl in a show was, and it ended up escalating far beyond normal levels)", "date": "2017-01-23", "comments": [{"text": "\"Who is best girl in Monogatari\".\n\nSo utterly pointless, it's clearly Kanbaru.", "date": "2017-01-23"}, {"text": ">What is the most pointless conversation relating to an anime you've ever had?\n\nAren't they all pointless?\n\n[](#smuglancer)\n\n>a pointless argument, like who best girl in a show was, and it ended up escalating far beyond normal levels\n\n[](#mitsukishock)\n\nOkay I changed my mind. Best girl contests are no joke OP. \n\n\nAnyway serious talk; I think the most pointless conversation relating to an anime for me was debating was about GATE where the main characters brought weapons into a Parliamentary discussion and I said there was no way those should be allowed.\n\nBut I guess no one liked it cause I remember people were actually being serious in their responses...\n\n", "date": "2017-01-23"}, {"text": "Whether *insert well rounded female character* is a tsundere or not. ", "date": "2017-01-23"}, {"text": "I actually knew a hardcore SAO, Fairy Tail fan that watches anime seasonally. He went on a very drawn out, poorly articulated tirade about why he thought Shouwa Genroku Rakugo Shinjuu was one of the worst shows of that winter season. I got a headache trying to figure out his perspective.", "date": "2017-01-23"}, {"text": "Any argument I had around Musaigen no Phantom World feels pointless now. Like, I'm glad i had them but...\n\nI still dont know how people expected more than that from it. I thought it was pretty well spelled out.", "date": "2017-01-23"}, {"text": "Me and some of my friends argued for awhile about whether [this character's](https://myanimelist.net/character/39755/Miyako_Shiina) hair is blue or purple. I don't think any of us have seen the show.", "date": "2017-01-23"}, {"text": "I talked to someone for a while about anime at a convention once, but everything I mentioned she had never heard of. Turns out she only watches stuff on Crunchyroll. ", "date": "2017-01-23"}]}, {"title": "Merch Mondays Megathread - Week of January 23, 2017", "text": "Weekly thread devoted to any and all new merch you may have picked up. If you've got physical goods to show off, it belongs here! \n\nHave a collection you've amassed that you'd like to show off instead? Don't be shy, you can post that here too!\n", "date": "2017-01-23", "comments": [{"text": "Bought my first Blu ray collection - the [Steins;Gate Complete Series](https://pbs.twimg.com/media/C2bScMnUoAAG-8e.jpg) off Amazon. My favorite series for only $27 is a bargain!", "date": "2017-01-23"}, {"text": "This week, my haul included:\n\n- [Shimakaze: The Four Seasons of Chinjufu Naval Base](http://i.imgur.com/E6HvkQN.jpg) [Warning: Kawaii Overload!]\n\n- [Is It Wrong to Try to Pick Up Girls in a Dungeon? - LN Vol. 1](http://imgur.com/a/jSwsg)\n\n- [All You Need Is Kill - Vol. 1](http://imgur.com/a/C8JAv)\n\n- And finally, because I'm a piece of shit that likes sexy 2D girls, I also got [this](http://imgur.com/a/NDqh8) and [this](http://imgur.com/a/YlDxj). [**NSFW WARNING!**]", "date": "2017-01-23"}, {"text": "As promised last week, [here’s](http://i.imgur.com/V6Sjr90.jpg) my Evangelion Unit 01 model. It also comes with a smaller pallet gun and knife, plus an AT field that I can’t seem to get it to hold without the hands falling apart. Still a very nice, poseable model, though I ought to get a stand so it can have a larger range of motion without falling over.\n\nI also got [this Gintoki figure](http://i.imgur.com/Yrg9riI.jpg) about a little while ago which I love. It’s surprisingly large and really detailed, down to the ‘Lake Toya’ on the sword hilt. You can also see a bunch of the random stuff I bought in Japan, including volume 26 of the manga (Yoshiwara in Flames arc) and a few badges.", "date": "2017-01-23"}, {"text": "I have a ton of stuff I need to read. Here's what I purchased:\n\n - SAO volume 9 \n\n - No Game No Life volume 5\n\n - Fate/Zero 1 and 2\n\n - OreGairu manga 3\n\n - Mahouka LN 1\n\nI *also* received volumes 1-3 of A Certain Magical Index a few days ago, and I plan on purchasing volumes 4-5 tomorrow.\n\nBarnes and Noble has some pretty good deals. Membership card + manga mondays = happy me. ", "date": "2017-01-23"}, {"text": "Got some Nice [series](http://imgur.com/XnjEtcP) lined up for me to watch over the next who knows how long.  Glad to get The Eccentric Family now that season 2 is coming out soon enough.", "date": "2017-01-23"}, {"text": "[Merry Christmas to me](http://i.imgur.com/wu6chS7.jpg)\n\nhttps://imgur.com/gallery/uw5Zl", "date": "2017-01-23"}, {"text": "[My new manga!](http://i.imgur.com/BPk3ttA.jpg?1)", "date": "2017-01-23"}]}, {"title": "What anime are you put off from watching?", "text": "It might be a small thing thats putting you off from watching the anime, or maybe nothing at all and for some reson you just dont want to watch it.   \n\nFor example, I want to watch Makoto Shinkai films, but I'm really put off on how much is gonna wreck me when i finish watching it. Its like it hitting a touchy subject which i cant tell what it is.", "date": "2017-01-23", "comments": [{"text": "Female fanservice-heavy shows in general. I used to have a masochistic tendency to watch them when my self-esteem was really, really low, and now that I'm mostly out of that rut I just get... irritated when I see it. I don't think it's sexist or anything, I just don't want to see it. I will still watch shows like Kill la Kill, but I'm holding off on Keijo (sad about this, I heard it saved anime) because I know I won't enjoy it. \n\nI also tend to avoid really long-running shows. (52+ episodes) I just don't have the commitment for something that long and likely varying in quantity. I like my anime short, sweet, and consistent.", "date": "2017-01-23"}, {"text": "I want to catch up to/get deeper into Gintama (I've seen the first 39), but I can't bring myself to put on another episode simply because I've already seen quite a bit, and while it is funny I'm still not engaged in the show. ", "date": "2017-01-23"}, {"text": "The Fate/ Series.\n\nIt seem this franchise recive much praise in this sub, but between the \"unfaithful\" first series, the complex watch suggested order, the multiples spinoff and sequels with many seasons and the visual novels. I just lost the motivation to start watching it.", "date": "2017-01-23"}, {"text": "[All of these](https://myanimelist.net/animelist/Teranwaterbender?status=6&tag=).\n\n\nReason being is time and burning out on anime-binging. ", "date": "2017-01-23"}, {"text": "I want to watch naruto but it's hard because I already read it so I know the major plot points and I hear the filler is shit.", "date": "2017-01-23"}, {"text": "Monogatari Series. I enjoyed Bakemonogatari and watched the first 3 episodes of Nisemonogari, which I thought were decent. There's just so much more to it and I always find something else that interests me more instead. \n\nI plan to watch the rest of it this year though.", "date": "2017-01-23"}, {"text": "Any of the ones that have hundreds of episodes.", "date": "2017-01-23"}, {"text": "mahouka\nhttps://m.youtube.com/watch?v=fdrWoCR5H-k", "date": "2017-01-23"}, {"text": "[One of these days, if I have some spare time, I would like to get through all of these shows](https://myanimelist.net/animelist/KWespell?status=6)\n\nSpecific shows I've put off are shows like Clannad and AnoHana, reason being, people keep saying how these shows always make them cry, and personally, I try to watch anime that cheers me up, not get me down, so I've avoided shows with that kind of reputation\n", "date": "2017-01-23"}, {"text": "I would like to watch HxH but it has way too many episodes. I'm not ready for that commitment. ", "date": "2017-01-23"}, {"text": "~~Any Yuasa and Ikuhara work. I want to watch them in production order.~~ \n\nOh whoops, misread the post. OG Mazinger and OG Getter Robo for being long episodic series. \n", "date": "2017-01-23"}, {"text": "Oddly enough [Aoi Bungaku](https://myanimelist.net/anime/7193/Aoi_Bungaku_Series), I don't think my heart is ready yet", "date": "2017-01-23"}, {"text": "Diamond No Ace\n\nIt's a sports shounen by Production I.G. so I'm sure it's amazing, but baseball to me is easily the least interesting sport.", "date": "2017-01-23"}, {"text": "I want to watch Shouwa Genro Raku.... the thing from Deen everyone is praising for being a mature drama or somethig, but I am not in the mood for something like this for months.\n\nI will try this after the exams...probably.", "date": "2017-01-23"}, {"text": ">I want to watch Makoto Shinkai films, but I'm really put off on how much is gonna wreck me when i finish watching it.\n\nHonestly, Shinkai has been experimenting with having more happy endings in his movies as of late. I get where you are coming from though. His earlier movies were nothing about pure despair and bad/bittersweet endings.", "date": "2017-01-23"}, {"text": "[I've only been binging longer shows like One Piece recently. So my PTW just keeps growing and growing](https://myanimelist.net/animelist/Dominic_Keats&view=tile&status=6)", "date": "2017-01-23"}, {"text": "Legend of the Galactic Heroes, Yuu Yuu Hakusho, Monster, Rurouni Kenshin, Cardcaptor Sakura... long series in general, they look good, but I need an extra motivator to start them, /r/anime rewatches help me like crazy with that (watched FMA;B, and currently following Hunter x Hunter thanks to them).\n\nI also actually tried Space Brothers and liked it, but the duration just put me off as well, I will have to give it a second chance in the future.", "date": "2017-01-23"}, {"text": "I never wanna watch Noragami Aragoto because the ending to season 1 was garbage.", "date": "2017-01-23"}, {"text": "Busou Renkin, Gochiusa, Yozakura Quartet, Servant x Service, and Nogizaka Haruka no Himitsu. Tried them all but can't get into them even though I want to.\n\n**Busou** - Action was ok, and the characters were fine, but everything was just too predictable. Didn't really engage me. Heard there was romance, which I'm a big fan of, but I'm not sure it's worth the ride.\n\n**Gochiusa** - I'm a pretty big fan of CGDCT. The show was cute, but just too much of nothing going on. Maybe it gets better/funnier idk.\n\n**Yozakura** - No idea what's putting me off about this one. Characters are likable, and the action/premise was enjoyable, but it just never grabbed me. Didn't seem like any romance was going to happen either.\n\n**SxS** - Was just a worse Working!! for me. Characters weren't nearly as likable, and the comedy, while similar to Working!!, just didn't hit home for some reason. \n\n**Nogizaka** - Seemed promising and I'd heard it was a good romance, but it was just made of cliche. If I had found it when it aired maybe I would have liked it more, but by now the tropes it uses are just way too worn. Characters and premise is fine, but everything else just loses me.", "date": "2017-01-23"}, {"text": "Spice And Wolf. I've watched the first two (or three ? can't remember) episodes, and I want to see a little bit more of it because the show gets a lot of praise and I like Holo. \n\nBut honestly it was really uninteresting so far ", "date": "2017-01-23"}, {"text": "Gintama for sure. Unless a comedy is really good, I get burned out around 7 or 8 episodes, and none of the clips I've seen of Gintama were that great.", "date": "2017-01-23"}, {"text": "All of the anime in my PTW", "date": "2017-01-23"}, {"text": "One Piece - Really long, and I'm not really sure if it's my kind of thing.\n\nMonogatari series - Just haven't been sold enough on it to give it a chance yet. \n\nLotGH - No reason. Just haven't taken the plunge yet. \n\nErased - No reason. Even though I might find it underwhelming as many have, I wanna try it myself. Just haven't yet.\n\nThere are a billion of titles I feel this way about but these come to mind first.", "date": "2017-01-23"}, {"text": "Sword Art Online. No, it's not because of the show's fanbase or detractors, but rather because I'm realizing that I like saying that I have no opinion about Sword Art Online. I feel like watching the show will almost be disappointing, because people either talk about the show as if it is something great or something that is the worst thing ever, and I already know that the show is neither so I'll probably just be bored. ", "date": "2017-01-23"}, {"text": "Anything older than 1995. It's just really hard to build a good atmosphere and watch a show continuously with blown out audio and poor art quality. The technology just wasn't there yet.", "date": "2017-01-23"}, {"text": "Ghibli films, the art is just way too off putting for me, a lot of people keep recommending them so i tried on of them, Kiki's Delivery Service, and its just okay at best. so wont bother to watch anything else", "date": "2017-01-23"}]}, {"title": "Weekly Genre Discussion - #9 - Vampire", "text": ">In this series of threads we will be taking a conversational journey through the many genres anime comes in. For the purposes of these threads we'll be going by the [list of genres MAL uses,](http://i.imgur.com/6Vfatmy.png) though some of them are a bit ridiculous and some of them are demographics.\r\n\r\nPlease make sure to use spoiler tags when relevant.\r\n\r\nAlso note that you can use [this website](http://graph.anime.plus) to check what anime you have seen in any particular MAL genre.\r\n\r\n#Today's genre is [Vampire](https://myanimelist.net/anime/genre/32/Vampire) \r\n\r\nSome questions to get conversation flowing (pick the ones that are of interest for you to discuss): \r\n\r\n1. What does this genre mean to you?\r\n\r\n2. What are your favourite vampire anime?\r\n\r\n3. Recent vampire anime you've seen? What did you think of them?\r\n\r\n4. What are the strengths of the genre in your opinion?\r\n\r\n5. What are the weaknesses of the genre?\r\n\r\n6. Is there anything unique about vampire anime that gives it an edge?\r\n\r\n7. Favourite vampire anime characters? How would they do in a non-vampire genre?\r\n\r\n8. Favourite songs from vampire anime? Favourite OPs/EDs? Insert songs?\r\n\r\n9. Favourite vampire anime setting? Why did it work so well?\r\n\r\n10. Favourite scenes from vampire anime? Link if you can.\r\n\r\n11. Favourite quotes from vampire anime?\r\n\r\n12. What traits do you think make a good anime vampire? \r\n\r\n13. Do you enjoy the tropes of the genre? What could be changed to make them more enjoyable without removing them?\r\n\r\n14. Do you have a favourite vampire manga? Has it been adapted? Should it be? What studio could make it work, or could have done it better?\r\n\r\n15. Best studio(s) for vampire anime?\r\n\r\n16. Anything you would like to see more of in the genre?\r\n\r\nAnd so on.\r\n\r\n---\r\n\r\nNext topic: Aventure anime", "date": "2017-01-23", "comments": [{"text": "[](#smugshinobu)\n\nI think the whole immortality thing pretty much drives the genre. \n\n", "date": "2017-01-23"}, {"text": "[Scratching my head](https://media.tenor.co/images/8d23f0cda1a62829fb879638eb390e03/raw) thinking of a good vampire anime", "date": "2017-01-23"}, {"text": "I remember thinking Blood+ was pretty cool, though it's probably been 8+ years since I've seen it so can't say much about it. ", "date": "2017-01-23"}, {"text": "Hikari from Interviews with Monster Girls is a top tier vampire, but best still goes to Shinobu Oshino.\n\nI can't really think of too many \"vampire\" anime I've seen. Hellsing Ultimate and Dance in The Vampire Bund (the latter of which I started but never got past the first episode due to life reasons).\n\nMostly my favourite vampire stuff comes from Shinobu and Hikari's antics.\n\n>10.Favourite scenes from vampire anime? Link if you can.\n\n[The bath scene with Shinobu and Koyomi in Nisemonogatari](https://youtu.be/sKVwqJNGAio) is what elevated Shinobu to best girl of the Monogatari series for me.\n\n>11.Favourite quotes from vampire anime?\n\nKaka", "date": "2017-01-23"}]}, {"title": "[Spoilers][Rewatch] Revolutionary Girl Utena - Episode 8", "text": "#Duel 8 - The Great Curry High Trip!\n***\n\n[← Previous Episode](https://www.reddit.com/r/anime/comments/5pdtv3/spoilerrewatch_revolutionary_girl_utena_episode_7/) | Next Episode →\n\n***\n\n**Information:** [MAL](https://myanimelist.net/anime/440/Shoujo_Kakumei_Utena) \n\n**Legal Streaming Option:** [YouTube](https://www.youtube.com/playlist?list=PLrrh84y760v-hDEulas0Tp_wiQy0FcjLl) (use a YouTube proxy if you are region blocked)\n\n**Genres:** Drama, Shoujo, Psychological, Fantasy, Comedy\n\n**Relevant Subreddit**: /r/shoujokakumeiutena\n\n***\n\n**Quote of the day**: \"Anthy\": \"There's just something wrong about complimenting your own body.\"\n\n**Screenshot of the day 1**: ~~[Dumbass]~~[Perv](http://imgur.com/A7Rg3Vc)\n\n**Screenshot of the day 2**: [Surfing Elephants](http://imgur.com/Ut4Mr86)\n\n\n***\n\n[**Rewatch Schedule Index**](https://www.reddit.com/r/anime/comments/5hhi8s/revolutionary_girl_utena_rewatch_schedule_and/)\n\n***\n\n#[Scoreboard](https://docs.google.com/spreadsheets/d/1WMjegKN4yhWyJ_nMHn-7s1TZ-AobDjGjoaSuFYNYkxU/edit#gid=444861530)\n\n\n***\n\n**Please refrain from posting any kind of spoilers relating to events that exist beyond the episode. I want new viewers in the rewatch (including myself) to have the closest experience to watching it as a currently airing anime. If you must talk about something in a future episode, please include 'Revolutionary Girl Utena spoilers\" in the link title.**\n\n*** \n\n**Extra Reading**\n\n- [Vrai Kaiser's Analysis of the Episode](https://vraikaiser.com/2014/09/19/curried-high-trip/) - Thanks to /u/lovelysugarboots for letting me know about the analysis. You can also check her analyses of previous episodes.\n\n\n\n", "date": "2017-01-23", "comments": [{"text": "In this episode: gap moe.\n\nI love how Touga hands over his entire wallet for some photos~                \n[Fanart of the day.](http://i.imgur.com/sMFkS48.png) - Saionji Kyoichi\n\nEpisode gif dump:\n\n* [mukashi mukashi](http://i.imgur.com/zvW1TY7.gifv)\n* [Utenanthy](http://i.imgur.com/JXDpcUp.gifv)\n* [oh, it's opposite day now!](http://i.imgur.com/wAwllKN.gifv)\n* [Anthena](http://i.imgur.com/z8wSIdV.gifv)\n* [Divine justice...](http://i.imgur.com/TrqwYaQ.gifv)\n* [...in action](http://i.imgur.com/Bvnnyup.gifv)\n* [those elephants](http://i.imgur.com/utYkOHX.gifv)\n* [nono(yes)](http://i.imgur.com/oqu8HtQ.gifv)\n* [those fucking elephants](http://i.imgur.com/wrueTAl.gifv)\n* [FUCKING ELEPHANTS](http://i.imgur.com/5dFVouX.gifv)\n* [grammar nazi sees the internet for the first time](http://i.imgur.com/PQs9F1F.gifv)\n* [(insert NOT EVEN MAD meme)](http://i.imgur.com/NLXpZ45.gifv)\n* [totally innocent face](http://i.imgur.com/6PW2pYB.gifv)\n* [practicing kendo, nbd](http://i.imgur.com/kwK04yi.gifv)\n\nAnyone reading this: feel free to make requests; timestamps are helpful.\n", "date": "2017-01-23"}, {"text": "Here is what Ikuhara’s episode commentary from the DVD Box Set has for us today. \n\n> 8: CURRIED HIGH TRIP [EPISODE 8]\n\n> As I said before, this was planned as episode 6. We’d originally contracted an outside studio to do it, but a few days before ADR was supposed to start, it became clear that virtually none of the production was done. We hurriedly swapped it with episode 8 (broadcast episode 6) in the schedule. The whole series of knockabout insanity that got bandied back and forth there was traumatically intense.\n\n> I don’t want to assign blame and try anyone in absentia here, so I won’t say any more about it.\n\n> But if you were to ask me whether I hate the episode because of that fuss, I’d say no, not really. In fact, there are many parts of it that I’m quite fond of. I think the colossal effort the staff put in with their backs against the wall like that sublimated the episode’s cheapness into solid humor.\n\n> That scene when our heroines’ daily lives with their switched personalities are stung together with snapshots… I’ve thought for a long time that the audio mix was kind of thin there, but in this 5.1 remaster, it’s finally got nice, lively sound.\n\n> Which reminds me: What had me worried during production was this episode’s “climax”.\n\n> “Which scene is the climactic one?!”, I agonized.\n\n> Looking back on it now, maybe it was the part when Nanami slipped on the banana peel?", "date": "2017-01-23"}, {"text": "Well that was another fillerlike episode. I actually laughed many times throughout it so I'm not complaining. This was a comedy episode and I laughed at every single elephant encounter, though the surfing elephants nearly killed me. Since it didn't advance the plot, I'm not going to do a write-up on the characters today. I'm interested in seeing everyone else's response to the episode though!\n\nOne thing that I noticed is that Saionji has green hair with purple eyes and Himemiya has purple hair with green eyes. I'm sure there's some sort of symbolism there. Maybe they really are made for each other. Or maybe that just means that they're complete opposites.", "date": "2017-01-23"}, {"text": "**[Freud's Couch]( http://i0.kym-cdn.com/entries/icons/original/000/014/040/theporncouch.jpg)- Symbolism Discussion Comment Thread**\n\n***\n\nComment thread for questions, answers and thoughts on anything in the series. Please do not spoil anything that has not happened in the series yet.\n", "date": "2017-01-23"}, {"text": "This show has god-tier humor. The comedic episodes are on par with the funniest anime I have ever watched and have very fast paced non-stop gags.\n\nI loved Nanami and the elephants, as well as Saionji's diary of Utena. It was also nice to see that Anthy has a flaw besides her lack of will (she isn't great at cooking), really felt like it added more to her character since it goes against her housewife image, even if it was just a gag.\n\nNow for some best guy reaction faces:\n\n[TFW Anthy slaps someone instead of getting slapped.](http://imgur.com/a/Pg3k3)\n\n[TFW you're spending your rent money on waifu merch.](http://imgur.com/a/NnVTy)\n\n[Let's beat it gang!](http://imgur.com/a/BBbvD)\n\n[Spoons are *much* better than cups.](http://imgur.com/a/kvvsc)\n\n", "date": "2017-01-23"}, {"text": "[Anthy gets slapped again.](http://i.imgur.com/2NiSxNH.png)\n\n[](#konodioda)\n\n[But it was me, Utena!](http://i.imgur.com/WGN3Usb.png) \n\nAnother hilarious episode, this time featuring Nanami's bizarre adventure in India. I really didn't think they could come close to the boxing kangaroo this fast, but they absolutely did it with the [surfing elephants](http://i.imgur.com/AYg5WtC.png) in this episode. \n\nI like how every single character gets goofy in these Nanami centric episodes. Saionji gets fooled every time anyway, but there are even funny Touga moments [like this.](http://i.imgur.com/Ny9MLTO.png) All I need is Juri being silly in an episode now! ", "date": "2017-01-23"}, {"text": "[Utena is a serious story full of symbolisms](http://i.imgur.com/u6zanbr.png)\n\n[Satanichia eating spicy food](http://i.imgur.com/p9G9rvh.png) vs [Everyone else](http://i.imgur.com/r9XwH9J.png)\n\n[My sides](http://i.imgur.com/G21o6dY.png)\n\n[I love Mickey](http://i.imgur.com/Sm5Wt0p.png)\n\n[One more for my gyroid collection in Animal Crossing](http://i.imgur.com/yYkAPkC.png)\n\n[Saionji took the \"I'm a terrible cook\" trope to a whole new level](http://i.imgur.com/YjsMg8a.png)\n\n[HAHAHAHA](http://i.imgur.com/uMNGnKt.png)", "date": "2017-01-23"}, {"text": "I'm watching through Utena for the first time right now. I must say, this episode was pretty fucking weird. ", "date": "2017-01-23"}, {"text": "Some thoughts.\n\n-Curry prank gone wrong!\n\n-Need to get me some of that curry powder.\n\n-An accurate portrayal of India.\n\n-I would totally buy those photos too\n\n-That drawing! I'm dying!\n\n-BITES THE DUSTO\n\n-Oh man that ending.\n\nAnother great episode.", "date": "2017-01-23"}, {"text": "Saionji truly is a tragic character.", "date": "2017-01-23"}, {"text": "This is my first time watching, but\n[theory](/s \"I think the guy that gets beamed into Utena during fights is the prince she met when she was little. Also maybe he's the End of the World that organized the student council?\")", "date": "2017-01-23"}, {"text": "8 episodes into my quest of watching Utena...\n\nNanami up to no good again! So this will hopefully be another fun episode as a result.\n\nWell of course they're okay, Touga! They wouldn't end the show after 8 episodes! And we know this was originally supposed to be episode 6 too.\n\nOh my, Utena is Anthy now and Anthy is Utena! Now that Utena is in Anthy's body she ain't taking all that slapping lying down! As I thought from yesterday's preview, we have body swapping today, something writer Enokido would do again in episode 19 of Star Driver.\n\nThe animation this episode is looking to be a bit lackluster compared to what its usually like.\n\nI love Nanami's laugh. LoL.\n\nSeems fitting that Nanami gets in trouble with animals yet again, this time a group of elephants! So hilarious that they find all these ways for them to foil her plans, even falling off a cliff.\n\nYikes! Saionji's being really creepy here.\n\nOMG now an elephant is running across the rope bridge!?!?! This is almost as epic as the kangaroo. :P And then they go even crazier with surfing elephants!\n\nLoL, Saoinji is pawned, yet again.\n\nOh my, a bonus appearance from shadow girls.\n\nNow Chu-Chu and Saoinji are gonna be switched? :P\n\nTotally a filler episode, but as with any episode that has Nanami it was a lot of fun!", "date": "2017-01-23"}, {"text": "Ahhhh I missed the last two episode discussions due to the Mod AMA and then staying over at a friends house!\n\nIt's fine though. I will say I loved the last two episodes, 6 was hilarious and 7 was incredibly interesting.\n\nNow onto this episode... Which looks to be a comedy, based on the episode title, but who knows with this show.\n\n- \"Both the Rose Bride and the one she's engaged to have been hurt\" Oh damn, I thought that was comedic effect. Something actually blew up?!\n\n- Ah jeez, what's up with Utena? She's acting so frail. And Anthy isn't... Have her and Anthy somehow switched personalties?\n\n- Yes, of course they have. Oh shoujo... As an aside, goddamn was it sweet to see Anthy slap someone.\n\n- Hehe, Nanami's actually going to India to get more spice.\n\n- WTF, second week? Day we explore our love? What the hell is he gonna do...\n\n- Oh okay, hahaha :'D Exchange diary, how... surprisingly nice of him? \n\n- No, *not* nice, I take back my surprise. \n\n- My subs don't have a sub for whatever Utena wrote in the diary... anyone know?\n\n- Oh wow, Anthy, that was a bit harsh. But LOL Chu-Chu as Saionji and Saionji as Chu-Chu are both hilarious. \n\nOverall a pretty damn funny episode, although I'm starting to realise I'm not the biggest fan of this one serious-one comedic episode format, but I've heard this show is quite slow to reveal information so it can't be helped I guess. \n\nAnd at least the comedy is *actually good*, unlike in, say, Higurashi, which had a similar format but with one comedic, 3-4 serious episodes.", "date": "2017-01-23"}, {"text": "**First Time Viewer**\n\nOn today’s episode of Revolutionary Girl Utena: Today’s episode is another surreal, wtf, and hilarious one, this time with Utena and Anthy having their personalities switched because they ate some explosive curry.\n\nNanami is planning another prank on Anthy, deciding to switch out the spice she’s using in cooking class for curry with far spicier curry. Unfortunately, her lackeys have gotten spice that’s far too spicy and there’s an explosion.\n\nAdmittedly, this is a funny reason for the Student Council to assemble. They’re worried that Utena and Anthy are injured in an event unforeseen by End of the World’s letters. But, Utena and Anthy are proclaimed okay.\n\nAs it turns out, Utena and Anthy have had their personalities switched with each other by the curry. I started to get something was wrong after Utena collapsed when Wakaba jumped on her back. But I only realized they had switched when Anthy slapped back the girls bullying her.\n\nIt is really odd to see Utena and Anthy acting like each other because they are so different from each other.\n\nBased on the fact that Utena and Nanami are acting like each other (which is already funny to see), Nanami and her lackeys realize that they’ve switched personalities.\n\nIt is funny to see the girls selling the photos they took as proof. It’s even funnier to see Miki lament the change in Anthy’s personality, before immediately buying a bunch of photos. And the funniest was Touga walking in to chastise Nanami, before buying an even larger amount of photos.\n\nBecause of this, Utena and Anthy figure out that they’re personalities have been switched. And Nanami admits she did it, rather than have Touga take the blame. So she and her lackeys go to India to get the curry spice again.\n\nThe running gag of Nanami’s adventures in India was hilarious every time they cut to it. The elephants constantly ruining everything just got funnier and more absurd as it went along. The funniest one was the surfing elephants, just because it was so bizarre.\n\nWhat was also funny was Utena, as Anthy, getting stuck in the exchange diary that Saionji has been keeping between him and Anthy.\n\nWow, Anthy is still as submissive as ever. She just throws out the diary when Utena says she doesn’t want to look in it and violate Anthy’s privacy, even though that’s not at all what Utena ment. \n\nUtena, after reading the unflattering insults Saionji made about her in the diary, is also funny as she decides to write the meanest possible thing to Saionji, before giving it to him with a smile.\n\nNanami finally arrives back from India with the secret spie, before ‘divine justice’ strikes and the spice is destroyed and scattered, meaning Utena and Anthy may be stuck like this.\n\nThe twist at the end is that the secret spice was never even used. Anthy’s cooking is just that terrible that she managed to switch their personalities just by cooking normally. Admittedly, that is a really funny twist.\n\nAnd of course Saionji stops by to complain now that he realizes Utena and Anthy have switched personalities, only for him to eat the curry at the same time as Chu-Chu does, causing another curry explosion that switches back Utena and Anthy.\n\nThe last bit in this episode made me lose it with laughter. Chu-Chu practicing kendo, with Saionji’s hairstyle and Saionji eating a banana in the treetops in a jungle. Those were hilarious.\n\nSide notes: I like how the shadow play came up a second time as the ‘divine justice’ it talked about struck Nanami.", "date": "2017-01-23"}, {"text": "This episode was \n\n#SO WEIRD\n\nThese Nanami episodes are crazy. ", "date": "2017-01-23"}, {"text": "Aye everybody! Welcome to the 8th episode of the rewatch. \n\nAnother comedy episode after yesterday's heavy hitting episode and it focuses on Nanami and her clique getting the ingredients for the 9 billion years folded spice. And it involves them going up against elephants who turn up out of nowhere to stop their progress on the savannah, mountains, narrow bridges and in the ocean. At least Nanami was happy to do it since her onii-sama wasn't angry with her.\n\nOne of the best things to see was Anthy slapping the [shit out of that girl]( http://imgur.com/udmTP9W). It marks the first time that a slap in the series was not done on Anthy.\n\nAnother funny thing was the entire debacle concerning Saionji's exchange diary. Saionji undressing himself to reveal the diary, \"Utena\" throwing it in the bin because it invaded her privacy and that quality drawing that Saionji drew. Of course Utena gets back at him by writing \"dumbass\".\n\nFinally, Chu-Chu and Saionji exchanged personalities because of the curry mishap. Perhaps he finally got some comeuppance. \n", "date": "2017-01-23"}, {"text": "Another silly episode following a serious one, a pattern we've settled into recently. It's been a while since I've seen a body swap episode (aside from [show title](/s \"Yamada-kun and the Seven Witches\") where it's a central premise).\n\n* Those elephants made me laugh every time they showed up, my favorite instance was them surfing but the one jumping off the cliff was a close second.\n\n* They did a great job of animating the facial expressions appropriately and I've never seen Utena look so serene or Anthy so agitated. Even their walking motions at the beginning were drastically different.\n\n* Utena slapping the girl that's been going after Anthy was great. Hopefully they'll leave her alone now, but probably not.\n\n* Everyone ordering photos (and the girls happily doing business) was funny. Miki at least recognized he was being weird while Touga was rather shameless.\n\n* Saionji's apparently innocent love of Anthy continues; maybe he's not that bad after all. While all of the student council are currently presented as the primary antagonists, I don't see it ending that way so I'm curious what will shake things up. Maybe the End of the World.", "date": "2017-01-23"}, {"text": "Good, another comedy oriented episode.   Quite the odd yet usual episode of bidy changing, nice Utena fixed some shit like Nanami's friends and burning Saiojin.\n\n* I loved Nanami's scenes in India. Did they went and return in a single day?", "date": "2017-01-23"}, {"text": "Been a little busy today, gonna watch the episode now. Will edit this later :) ", "date": "2017-01-23"}]}, {"title": "Log Horizon Abridged Episode 2", "text": "", "date": "2017-01-23", "comments": []}, {"title": "5 More Winter Anime 1st Impressions", "text": "", "date": "2017-01-23", "comments": [{"text": "A Bonus follow up from the [10 Winter Anime 1st Impressions](https://www.youtube.com/watch?v=Ssy7csJWFNw&t=311s) from a few days ago, Enjoy! 😄\n", "date": "2017-01-23"}]}, {"title": "AniPod Episode 2 - Winter Anime 2017 Impressions (RCAnime, Canipa Effect, Glen)", "text": "", "date": "2017-01-23", "comments": [{"text": "I'm a little out of the loop, is AniFix dead? Are you guys just rebranding? \n\nLove the podcast and your YouTube channels, keep it up!", "date": "2017-01-23"}]}, {"title": "'Your Name.' passes 3 million viewers, becoming the most viewed animated Japanese film in South Korea", "text": "", "date": "2017-01-23", "comments": [{"text": "This film sounds good. Never heard of it.", "date": "2017-01-23"}, {"text": "Okay what is the meme train/sarcastic sass this stuff gets?\n\n\n>Still can't watch it\n\n>It's gonna cure cancer next!\n\n>I'm so hyped for this one!\n\n>With all this hype it's bound to disappoint!\n\nWhat else am I missing?\n\nAlrighty jokes aside this is a nice trend to see anime grow. I hope this leads to greater marketing outside of Japan. \n\nEdit: Oh wait I should probably take my serious comment out cause no one likes serious comments in these threads...", "date": "2017-01-23"}, {"text": "[waiting for kimi no na wa](https://www.youtube.com/watch?v=i84UiuzlPwI)(as well as the end of threads about its popularity)", "date": "2017-01-23"}, {"text": "Another 3 million people who have seen it before most of us.", "date": "2017-01-23"}, {"text": "Good thing I live in South Korea then. Time to go watc...\n\n[](#haruhiisnotamused)", "date": "2017-01-23"}]}, {"title": "Judge my taste and post your MAL so i can judge yours", "text": "https://myanimelist.net/animelist/longai11\n\nmy MAL better cause i have Monster and the mystery/thriller genre is the best. feelsgoodman go watch sum shin sekai yori or shiki also n git gud. ", "date": "2017-01-23", "comments": [{"text": "No Love Live, your opinion is shit and irrelevant.", "date": "2017-01-23"}, {"text": "Gave Mirai Nikki a higher rating than Madoka\n\n0/10 shit taste", "date": "2017-01-23"}, {"text": "You are the guy who called me a trash weeaboo for dropping shinsekai yori. I guess the same insults can be thrown back at you without changing much. ", "date": "2017-01-23"}, {"text": "https://myanimelist.net/profile/Auracity\n\nedit: [here's my \"other\" MAL ^^^^it's ^^^^my ^^^^hentai ^^^^account... ^^^^:(](https://myanimelist.net/profile/Hiratsuka)", "date": "2017-01-23"}, {"text": "[My MAL](https://myanimelist.net/profile/Golga10)  \n  \n@OP I hope you don't expect anyone to ever take you serious when you have Aki-Sora as a 10/10", "date": "2017-01-23"}, {"text": "> Aki Sora - 10/10, Yosuga no Sora - 8/10\n\nNo matter if your tastes or shit or not, I respect someone so unabashed in their fetish for incest.\n\nedit: [mine](https://myanimelist.net/animelist/Lilyvess?status=2&order=4&order2=0) if you want to judge.", "date": "2017-01-23"}, {"text": "[MAL](https://myanimelist.net/animelist/Amadoxxx?status=2)", "date": "2017-01-23"}, {"text": "[Don't hold back](https://myanimelist.net/profile/TobiMTA)", "date": "2017-01-23"}, {"text": "[My profile picture is probably the best part of my list TBH](https://myanimelist.net/profile/Kamilny)\n\nYou rate real weird.", "date": "2017-01-23"}, {"text": "I don't even have to look,you're not me so surely your taste must be shit...", "date": "2017-01-23"}, {"text": "[Give me hell](https://myanimelist.net/animelist/Roronoaashok)", "date": "2017-01-23"}, {"text": "[Let me see your terrible taste](https://myanimelist.net/profile/AniMonologues)", "date": "2017-01-23"}, {"text": "[I'm used to getting roasted](https://myanimelist.net/profile/Angst-Incarnate)", "date": "2017-01-23"}, {"text": "judge me\n\n[MAL](https://myanimelist.net/animelist/PajamasM)", "date": "2017-01-23"}, {"text": "Here goes nothing\n\nhttps://myanimelist.net/animelist/Zbstevens", "date": "2017-01-23"}, {"text": "[Here](https://myanimelist.net/animelist/Pamasich)", "date": "2017-01-23"}, {"text": "[Here is mine!!](https://myanimelist.net/animelist/Approva)\n\nOP, I respect that 10/10 Aki-Sora rating.", "date": "2017-01-23"}, {"text": "We disagree in quite a lot of stuff, but you have Steins;Gate and Higurashi rated high, so I'm more than fine with that.\n\nI really need to give a try to Monster.", "date": "2017-01-23"}, {"text": "MAL is in my flair.\n\nWe've got a 36% affinity but you gave ERASED an 8 so you're dead to me.", "date": "2017-01-23"}, {"text": "[Here it is!](https://myanimelist.net/animelist/TEH13370TAKU) Feel free to judge my shit tastes.", "date": "2017-01-23"}, {"text": "Holy shit 73.9% affinity! That's the highest I've seen\n\n[Here's mine OP](https://myanimelist.net/animelist/internetdude9001)", "date": "2017-01-23"}, {"text": "[MAL](https://myanimelist.net/animelist/Unorthodox_?status=2) ", "date": "2017-01-23"}, {"text": "[List](https://myanimelist.net/animelist/Addi) | [Profile](https://myanimelist.net/profile/Addi)", "date": "2017-01-23"}, {"text": "[deleted]", "date": "2017-01-23"}, {"text": "[My **MAL** :v](https://myanimelist.net/profile/Takana_no_Hana)", "date": "2017-01-23"}, {"text": "Only 40% affinity, sorry. Mine's in my flair", "date": "2017-01-23"}, {"text": "[fite me](https://myanimelist.net/animelist/willsolvit?status=7&order=4&tag=)", "date": "2017-01-23"}]}, {"title": "What anime character has the funniest voice to you?", "text": "So who's voice in anine makes you laugh the most? Personally, while watching HxH, I found myself cracking up like 70% of the time le'oreo  was talking.", "date": "2017-01-23", "comments": [{"text": "Nonon.\n\n[](#nononkek)", "date": "2017-01-23"}, {"text": "Ranko Hata from Seitokai Yakuindomo\n\nAlso a lot of the characters Yuu Kobayashi voices ", "date": "2017-01-23"}, {"text": "[this fucker right here](https://embed.gyazo.com/f6892e783ab49c2b78f7ae6aa5d35646.png)", "date": "2017-01-23"}, {"text": "**[Pika from One piece.](https://www.youtube.com/watch?v=a6-42G6qdcc)**\n\nI laughed so much at that voice.", "date": "2017-01-23"}, {"text": "[Prince Hata from Gintama](https://vimeo.com/72112337)", "date": "2017-01-23"}, {"text": "Aqua running from toads", "date": "2017-01-23"}, {"text": "Aqua (Sora Amamiya), mainly when she's screaming ", "date": "2017-01-23"}, {"text": "Kamiya Hiroshi as Penguin-san from Shirokuma Cafe ", "date": "2017-01-23"}, {"text": "Zura gets me everytime", "date": "2017-01-23"}, {"text": "[Ritsu from K-on has by far the best VA performance in the show](https://www.youtube.com/watch?v=3eU6kZirS7E), with Yui close in second.", "date": "2017-01-23"}, {"text": "Prince Hata from Hintama, his voice is inherently funny. Especially well used when he was overdubbing someone else.", "date": "2017-01-23"}, {"text": "Kintarou in the Golden Boy dub. Its just...[ magic.](https://www.youtube.com/watch?v=bHmBSfci0yE) ", "date": "2017-01-23"}, {"text": "Old Joseph's voice combined with Engrish is hilarious.", "date": "2017-01-23"}, {"text": "Buggy the Clown", "date": "2017-01-23"}, {"text": "[The Jaxa director from Space Brothers](https://www.youtube.com/watch?v=H3aOtJaoxcQ)", "date": "2017-01-23"}, {"text": "what you guys know about winner [sinclair](https://www.google.com/imgres?imgurl=http%3A%2F%2Forig09.deviantart.net%2F7f65%2Ff%2F2011%2F109%2Fb%2F8%2Fwinner_sinclair_by_kenore-d3ecwi3.jpg&imgrefurl=http%3A%2F%2Fkenore.deviantart.com%2Fart%2FWinner-Sinclair-205515147&docid=v5dCGSQELWj14M&tbnid=l7lyd3z6ono6TM%3A&vet=1&w=480&h=272&hl=en-us&client=safari&bih=337&biw=736&q=winner%20sinclair&ved=0ahUKEwiy44fB9tbRAhUr04MKHdMGCisQMwgfKAEwAQ&iact=mrc&uact=8) ?", "date": "2017-01-23"}, {"text": "[I like Ed's voice(dub) from Cowboy Bebop.](https://www.youtube.com/watch?v=N6QyiDDci0o)", "date": "2017-01-23"}, {"text": "Any character voiced by Miyano Mamoru. That guys is hilarious and talented!", "date": "2017-01-23"}, {"text": "[Keiichro](https://www.youtube.com/shared?ci=Kkt_XpV9-zI) from Ghost Stories(Dub) was fucking hilarious. ", "date": "2017-01-23"}, {"text": "One of the voices i think never fit quite right was the one waitress girl from Rurouni Kenshin. That talked in like a thick Southern accent in the dub. It always shocks me at how out of place it is.", "date": "2017-01-23"}, {"text": "Prince Hata from Gintama", "date": "2017-01-23"}, {"text": "Yuuichi Nakamura in any role where he isn't quiet sounds really funny. Like Kuro from Haikyuu or Tomoya at times in Clannad. It's such a unique voice.", "date": "2017-01-23"}]}, {"title": "Gahara-sama narrating mario", "text": "", "date": "2017-01-23", "comments": [{"text": "Chiwa Saito should do ASMR videos in Gahara voice. Something about this is ridiculously satisfying to me.\n\nEDIT: I just found this [Koyomi and Hitagi](https://www.youtube.com/watch?v=Xba5AxdJy7Q) let's play and I never knew I wanted this in my life.", "date": "2017-01-23"}, {"text": "I really wish this had english subtitles", "date": "2017-01-23"}]}, {"title": "What is an adaptation/sequel to an anime series you want, and how could it disappoint you the most?", "text": "How could a sequel or adaptation you would normally look forward to hurt you the most? For example:  \n  \n[Code Geass](/s \"S3 arrives, and they pull an Aldnoah.Zero and Lelouch comes back to life with no consequences.\")", "date": "2017-01-23", "comments": [{"text": "EVA Rebuild 4 ending in any normal way. I won't be satisfied with less than footage of Anno sitting naked on a chair reciting Freude Schöner Götterfunken in french while they project clips from the End of Evangelion over various bodyparts.  ", "date": "2017-01-23"}, {"text": "Haruhi S3.\n\nIt's a pachinko machine.", "date": "2017-01-23"}, {"text": "Spice and Wolf S3.  \n  \nBy not existing.", "date": "2017-01-23"}, {"text": "Tokyo Ghoul season 3\n\nPls no.\n\nIf Pierrot fucks up :re too, they'll get no mercy from me.", "date": "2017-01-23"}, {"text": "There are two that fit this really.\n\n[Katanagatari](/s \"It basically becomes Sword & Wolf following Hitei and Shichika\")\n\nIt existing would disappoint me, because then the ending was for naught and completely pointless.\n\nHaruhi\n\nIf they just skip to Dissociation/Surprise. \n\n* Anime onlys can't watch it\n\n* They skip all of the remaining development for Yuki\n\n* They skip the introduction to Koizumi's development\n\n* They skip one of the most significant scenes with regards to Haruhi and Kyon\n\n* They skip Intrigues, an entry that is arguably better than Disappearance", "date": "2017-01-23"}, {"text": "Make a longer version of Angel Beats exploring the other characters too, and then make an After Story series or at least a movie or a special or something\n\nPlez", "date": "2017-01-23"}, {"text": "i would like to see gantz fully adapted, but censoring it would kill the show.", "date": "2017-01-23"}, {"text": "I heard they are making Tsugumomo into an Anime, I'm really excited for that I've been wanting one for a while.  But I kinda hope they tone down the fanservice, it works in the Manga, but some of it can get pretty ridiculous, which often takes away from the tone in an Anime.   \n\nSpeaking of ridiculous fanservice I think its about time Miyamoto-kun Monogatari got an ~~anime~~.... hentai.  ", "date": "2017-01-23"}, {"text": "If they ever decide to animate HakoMari, and then they half-ass the adaptation by cutting it of somewhere pre-Volume 7. Like, why even adapt it then? Why even live? T.T", "date": "2017-01-23"}, {"text": "Another season of Build Fighters...but still with the Try cast. BFT is so far the most disappointing sequel I ever watched and I hope never to get more of it.", "date": "2017-01-23"}]}, {"title": "From experience, when do you think we'll see theaters/tickets for Your Name in North America?", "text": "I haven't followed something like this before, so to have heard so much and so little about it I'm really interested in seeing this, any it lines up with my birthday around April. My only concern is that it will not play anywhere local for me like a lot of other animated films have in the past. So I'm just wondering how much notice do you think we'll receive for locations where it will be playing so I can start making travel plans if need be?  \n\n I know no one will have a definitive answer, but just based on other animated films in the past or something maybe we can try and come up with some information? I'm in Canada also.", "date": "2017-01-23", "comments": [{"text": "Go on your local theater's website and check", "date": "2017-01-23"}, {"text": "[Yep](http://www.animenewsnetwork.com/news/2017-01-19/shinkai-your-name-film-to-play-on-200-n-american-screens-and-in-japan-in-english/.111185)\n\n200+ theaters in North America on April 7th.", "date": "2017-01-23"}]}, {"title": "Youjo Senki AMV - Battleloli 1", "text": "", "date": "2017-01-23", "comments": []}, {"title": "Best Guys Contest 3: Shinomonogatari! Round 4 Bracket C!", "text": "#[Vote here!](https://animebracket.com/vote/best-guy-3-saltgatari/)\n\n#[Results here](https://animebracket.com/results/best-guy-3-saltgatari/?group=2)\n\n---\n\nMini challenge:\n\n* What's your favorite OST? \n\n* Who's your favorite seiyuu? \n\n[Happy voting!](#teehee)\n\n", "date": "2017-01-23", "comments": [{"text": "[MFW](http://i.imgur.com/xXMcXdy.gif) Dio lost.\n\nAt least he lost to a good character so I can't be too salty.\n\n[James is also finally out too.](http://i1.kym-cdn.com/photos/images/original/000/950/415/88d.jpg_large)\n\n[](#toradorasalute)", "date": "2017-01-23"}, {"text": "Guys please don't let Shinji lose to Armstrong. All Armstrong has going for him is his muscles and \"ITS BEEN IN THE ARMSTRONG FAMILY FOR GENERATIONS\". Shinji on the other hand is one of the most well written and developed characters in all of anime. ", "date": "2017-01-23"}, {"text": "Vote for Shinji! \n\nF U C K E D U P B O Y S", "date": "2017-01-23"}, {"text": "I want to say, \"VOTE FOR SHINJI, GUYS\", but I feel like that's a lost cause. \n\n>What's your favorite OST?\n\nEither Kill la Kill or Panty & Stocking ", "date": "2017-01-23"}, {"text": "LAWRENCE BEAT GENOS\n\n[](#woo)", "date": "2017-01-23"}, {"text": "Spike beat Dio pretty easily. Didn't see that coming", "date": "2017-01-23"}, {"text": "**GO KILLUA GO** ", "date": "2017-01-23"}, {"text": "We're taking Kaiki all the way! \n\nVote for Guts! \n\n>who's you favorite seiyuu?\n\nTied between Kamiya Hiroshi and Jun Fukuyama ", "date": "2017-01-23"}, {"text": "First time everybody I actually voted for got through! \n\nThanks r/anime.\n\n\n\n[](#happypoi)\n\n#Don't forget to vote Killua! ^^^andGuts", "date": "2017-01-23"}, {"text": "\nGon and Meruem lost.\n\n[**TRIGGERED**](#triggeredkillua)\n\nRIP James, too. At least he did really well against some tough opponents. \n\nA lot of great characters in this round though. I'm especially rooting for Shinji, Killua and Gil. ", "date": "2017-01-23"}, {"text": "Vote for Killua!", "date": "2017-01-23"}, {"text": "Gilgamesh versus Lancer! There's a strong theory that Lancer would have easily wiped up the whole 5th Holy Grail War if [F/SN](/s \"he hadn't gotten unfairly gimped right from the start by Gil's existence.\") Give best guy Cu the justice he deserves! ", "date": "2017-01-23"}, {"text": "Fuck it I'm Voting kakashi. He deserves at least some\nVotes. ", "date": "2017-01-23"}, {"text": "Vote for Shinji! Give the poor boy some love.  \n  \n[](#shinjimug)\n  \n>What's your favorite OST?  \n  \nMacross Plus!  \n  \n>Who's your favorite seiyuu?  \n  \nRyo Hirohashi (Kyou from Clannad, Yamada from Working!!, Alice from Aria)", "date": "2017-01-23"}, {"text": "You're goddamn right Kaiki won. \n\n>What's your favorite OST?\n\n*Single Tracks:* [Deep Sea (Arakawa under the Bridge)](https://www.youtube.com/watch?v=AkFABXvp-FA) and [Yojouhan Ki Owari (the Tatami Galaxy).](https://www.youtube.com/watch?v=tlUHfx9aS2k)\n\n*Full soundtrack*: [The Tatami Galaxy](https://www.youtube.com/watch?v=nXXGIFNvWA4) or [The Eccentric Family.](https://www.youtube.com/watch?v=HKN1rglz9VQ&index=3&list=PLwnk87KownNUN40rcgCRSQFeQNWnVpy5Y)\n\n>Who's your favorite seiyuu?\n\nTakahiro Sakurai!", "date": "2017-01-23"}, {"text": "Meruem lost. :(", "date": "2017-01-23"}, {"text": "Yato isn't by any means a better character than Meurem.\n\nThe anime didn't even [Noragami manga](/s \"adapt his full backstory and even if I consider this it wouldn't be enough.\")", "date": "2017-01-23"}, {"text": "Mah boy Lawrence did it! \n\n[](#excitedyui)", "date": "2017-01-23"}, {"text": "Favourite OST's: Clannad, Haikyuu and Nagi no Asukara\n\n", "date": "2017-01-23"}, {"text": "How can Kaiki win if we all agreed Kaiki is best girl?", "date": "2017-01-23"}, {"text": "Now that he's the only HxH character left...\n\nVOTE KILLUA", "date": "2017-01-23"}, {"text": "[Time to release the hound](http://imgur.com/a/yJuQv)\n\n[After Shichika is done with Scar he'll be living up to his name](http://24.media.tumblr.com/8062eec766390a19a3de5d596b21cfdf/tumblr_n0r8qdFqd81rydwbvo2_500.gif)\n\n[This is Togame imitating Scar after the two fight](http://imgur.com/a/F8qSq)\n\n#[However,](http://pa1.narvii.com/5934/d366267c960b3e4f26510f7e472ed4388a5998bd_hq.gif)\n\n[by that point he'll have already been torn to pieces.](http://25.media.tumblr.com/de5005d47890bf272b90a179b6e44461/tumblr_mqf3d5KK8K1rsheh9o1_500.gif)\n\n\n", "date": "2017-01-23"}, {"text": "Mini Challenge:\n\n> What's your favorite OST?\n\nI've gotta go with Hunter x Hunter there's so many perfect tracks that really evoke certain feelings on there.\n\n> Who's your favorite seiyuu?\n\nI really like Takahiro Sakurai there's just something about his voice that gives I guess a certain quirk to his characters that's so fun", "date": "2017-01-23"}, {"text": "Another Meme bites the dust.\n\n> Who's your favorite seiyuu?\n\nKamiya Hiroshi and Sayaka Ohara!", "date": "2017-01-23"}, {"text": "[VOTE](#killuadisgust)\n\n[KILLUA](#triggeredkillua)", "date": "2017-01-23"}, {"text": "Lancer has the smug...\n\n[ ](#smuglancer)\n\nBut he doesn't have the king's level of superiority! Don't be a mongrel dog, vote Gilgamesh!\n\n[ ] (#psh-mongrels)\n\n\n[Fate/Stay Night DEEN anime and VN Fate route] (/s \"Coincidentally, Lancer should live for exactly 24 more hours, just like in the VN's Fate route and the DEEN anime I haven't watched, heh. Unlucky he doesn't have the Fate/Grand Order class triangle giving him that Lancer>Archer advantage.\")\n\n>What's your favorite OST?\n\nAnything by Yuki Kajiura, if \"one\" anime then her Kara no Kyoukai composition as a whole, if one specific track I can hardly decide but will offer up [Into the Light](https://www.youtube.com/watch?v=b1YF5TB-MNQ). It's... beautiful. \n\n>Who's your favorite seiyuu?\n\nHiroshi Kamiya and Seki Tomokazu are great, but let's go with Saito Chiwa.\n\n", "date": "2017-01-23"}, {"text": "How did r/anime pull itself together long enough to get Lawrence past a OPM character? This is wonderful", "date": "2017-01-23"}, {"text": "Meruem lost, maybe I need to watch Noragami...\n\n> What's your favoritw OST?\n\nFor whole shows I don't have, but individually, I fucking love The World of Adventurers/Gon's theme from HxH.", "date": "2017-01-23"}, {"text": "I was wondering for a while now, but why is Roy Mustang not in here?", "date": "2017-01-23"}, {"text": "Favourite OST...somewhere between Haikyuu and Hibike! Euphonium\n\nFavourite seiyuu is definitely Miyano Mamoru, followed very closely in a tossup between Takahiro Sakurai, Namikawa Daisuke, and Nakamura Yuuichi", "date": "2017-01-23"}, {"text": "Hardest one was Killua vs L, but ultimately I had to give it too Killua. His growth from beginning to where he is now is beautiful and I enjoy almost every one of his fights. Pretty much the main character for me since I don't like Gon that much.", "date": "2017-01-23"}, {"text": "KRAFT DID IT, KRAFT DID IT!!! And Kaiki too!! Hell yeah!!\n\nToday two of [my guys](http://imgur.com/a/WLosD) needs your help, **VOTE OKABE AND SHINJI**\n\n-----------------------------------------\n\n> What's your favorite OST?\n\nI will say Madoka Magica\n\n> Who's your favorite seiyuu?\n\nSaori Hayami", "date": "2017-01-23"}, {"text": "Another round, another Win for Best Girl\n\n[](#cup2 \"Now to lose to bide time until the inevitable loss because Araragi won last contest.\")\n\nMini-challenge: FLCL has probably my favorite OST, but single track wise it's definitely [Kami-sama no iutoori](https://www.youtube.com/watch?v=lMQK5MbIb1E) from Tatami Galaxy.", "date": "2017-01-23"}, {"text": "Hoping for Guts to make it to another round.", "date": "2017-01-23"}, {"text": "[God #1 of the new world](http://pm1.narvii.com/5759/08e9c62104ccc7e463f66eaee9ba1382f20b98f9_hq.jpg)\n\n[God #2 of the new world](https://fantasticmemes.files.wordpress.com/2013/06/fvsgvp4.jpg?w=512&h=288)\n\n", "date": "2017-01-23"}, {"text": "Oh man, its gonna be Hachiman vs Spike again. Hope 8man can pull through this time", "date": "2017-01-23"}, {"text": "James lost\n\n[](#shatteredsaten)", "date": "2017-01-23"}, {"text": "Huh, Genos lost, i honestly wasn't expecting it.\n\n> What's your favorite OST?\n\nClannad's OST.\n\n> Who's your favorite seiyuu?\n\n[Chiaki Omigawa.](https://myanimelist.net/people/1760/Chiaki_Omigawa)", "date": "2017-01-23"}, {"text": "Kaiki vs Light hype\n\nFavourite OST atm: [One Calm](https://youtu.be/vlrMRSWcoHI)\n\nVA: I am a fan of Kazuya Nakai", "date": "2017-01-23"}, {"text": "Sora lost by such a close count that I can't stay mad. \n\nShizuo lost but I didn't have it in me to vote against 8man ¯\\\\_(ツ)_/¯", "date": "2017-01-23"}, {"text": "COME ON KAIKI!!! YOU CAN DO IT!!\n\nEdit: favorite OST? Not sure but it's definitely something from the Monogatari series", "date": "2017-01-23"}, {"text": "Lawrence pulled through! Hot damn! Ryuuji had a good run too, but he's pretty much done now. Kamina is too bro for him to overthrow. Now just need to get Shichirin to the finals! CHEERIO!", "date": "2017-01-23"}, {"text": "> Favorite OST\n\nI'ma cop out and go with those by Yuki Kajiura\n\n> Favorite Seiyuu\n\nChiwa Saito!", "date": "2017-01-23"}, {"text": "Here comes salt mountain.", "date": "2017-01-23"}, {"text": "Mark my words r/anime, a meme character is going to win this contest.  \n>What's your favorite OST?\n\nKara no Kyoukai's by a long shot, nothing has ever come close to it for me.  \n>Who's your favorite seiyuu?\n\nCrispin Freeman, he is an amazing english voice actor and IMO he is better than his japanese counterparts. ", "date": "2017-01-23"}, {"text": "Killua Vs. L is going to be interesting. My money is on HxH but maybe DN's highest popularity will pull L through.  \n\n\nEDIT: No way 8man will beat Spike. ", "date": "2017-01-23"}, {"text": "Holy shit Dio got clapped, didn't expect it to be that one-sided.", "date": "2017-01-23"}, {"text": "Everybody vote [Best Guy](http://m.imgur.com/Vbx9JNL?r)", "date": "2017-01-23"}, {"text": "Man that vote differential between DIO and Spike is huge. I had to vote for Spike myself, I couldn't not but I sorta expected it to be closer. It's just unfortunate he had to face Spike here, probably could have gone further otherwise.\n\nI'm a little disappointed Meruem didn't make it, also perhaps exciting we had a big upset (if the seeding is any indication) with Lawrence beating Genos. The next highest seed to have lost is Greed at 17, followed by Sora at 20. I still haven't seen Spice and Wolf, keep meaning to check it out.\n\nWell, on to today. Some of these are hard, gotta vote Guts though!  Also Shichika, Killua, and Armstrong just because I want to see Shinji out. I think of all remaining characters he's the weakest of the bunch.", "date": "2017-01-23"}, {"text": ">What's your favorite OST?\n\nTabi no Tochuu from Spice and Wolf\n\n>Who's your favorite seiyuu?\n\n* Male: Jouji Nakata\n* Female: Shaori Hayami", "date": "2017-01-23"}, {"text": "Wow, I'm genuinely surprised that Ryuji made it through! Nice work, guys!", "date": "2017-01-23"}, {"text": "Sakamichi no Apollon and Cowboy Bebop have my favourite OSTs. Yoko Kanno has produced some incredible soundtracks in her time.", "date": "2017-01-23"}, {"text": "tfw Genos gets knocked out  \n  \ntfw Ed and his Dad are against each other", "date": "2017-01-23"}, {"text": "Ed vs Hohenheim. Family Drama got me like\n\nhttps://s-media-cache-ak0.pinimg.com/564x/a6/f3/78/a6f378ec7ed53d4dc9585bf2ac61b240.jpg", "date": "2017-01-23"}, {"text": "Ryuuji, Kaiki, 8man, Lawrence... almost all my votes won this time :D (rip Nozaki, although ofc we all knew Kamina would win)", "date": "2017-01-23"}, {"text": "Too many jojo fans here", "date": "2017-01-23"}, {"text": "[YOU SHOULD BE VOTING GUTS](http://i.imgur.com/sdhb4Le.jpg)", "date": "2017-01-23"}, {"text": ">What's your favorite OST?\n\nFLCL and Sora no Woto\n\n>Who's your favorite seiyuu?\n\n[Aoi Yuuki](#kayosmile)", "date": "2017-01-23"}]}, {"title": "Just wanted to share these videos on Miyu Matsuki. Rest in Peace (2015).", "text": "Before the videos, If you know who Miyu Matsuki is (real name Mieko Matsuki), what is your favorite role from her? Mine is definitely Yoshinoya-sensei from Hidamari Sketch. I feel like her genki voice fits the character so damn well. Her voice as Harumi from Zetsubou Sensei is also great...\n\n Rest in peace, Matsuki. I found this tribute to her, https://www.youtube.com/watch?v=S5rlD6KqNaU . Please pardon the background gaming, I don't really know who this youtuber is (MrDanteDavid), but thanks to him for making a tribute to her. The one snippet he included from a radio show she once participated in is really good, but kinda' fucking broke me down, bewarned. Here is a video of multiple roles from her, with little snippets of her voice acting. https://www.youtube.com/watch?v=3iv2wYWPnX4 .\n\n\n Sorry if this post is a tad random and I realize it is extremely late since she passed in 2015, but since I'm rewatching Hidamari Sketch (wonderful show), everytime I hear some great acting from Miyu's Yoshinoya, i kinda' tear up. God, just knowing she'll really never be in anything else makes me devastated. At least she voice acted at all, bless her.", "date": "2017-01-23", "comments": [{"text": "I mean, this is a bit random. The one roles I have seen her in would be:\n\nIsumi from Hayate.  \nAnna from Shimoneta ~~who I hate~~  \nSayoko Natsume from Hantsuki (which is a pretty minor role)\n\nSo I would probably go for Isumi", "date": "2017-01-23"}]}, {"title": "Your least favorite pilot episode of anime", "text": "Digibro made videos about this. Pilot episodes are supposed to introduce you to the substance of the series. When a pilot fails at hooking you, it makes you not want to check out the rest of the series. One example is the pilot episode for GATE, as explained by Digibro.", "date": "2017-01-23", "comments": [{"text": "Occultic;Nine first episode is essentially just throwing a shit ton of characters and concepts at you, and that with a talking speed probably never seen in anime ever before.", "date": "2017-01-23"}, {"text": "Fate Zero's pilot was one long, rambling mess.", "date": "2017-01-23"}, {"text": "SaiKano's is probably the worst i've finished.", "date": "2017-01-23"}, {"text": "NGE comes to mind. I recently finished the show and I loved it overall, but I dropped it after two episodes the first time I tried. It didn't really interest me until episode four (hedgehog's dilemma), but YMMV.", "date": "2017-01-23"}, {"text": "Not a big fan of the Gintama pilot episode", "date": "2017-01-23"}, {"text": "I dropped HxH for at least 6 months after watching the first episode.", "date": "2017-01-23"}, {"text": "Divine Gate.\n\nLet's start the episode with a angsty-emo hormonal filled teenage guy monologue from /r/iamverysmart.", "date": "2017-01-23"}, {"text": "I liked the first Gate episode. I was very impressed that the modern world wasn't roflstomped by magic for once and that the protagonist was an working adult in the commando structure of an actual military, not some weird organisation where people just do was they wish.\n\nAs for bad first episodes, IDOLM@STER bored me to death and threw way too many characters without explanation into the picture. It went better sharply after that episode.", "date": "2017-01-23"}, {"text": "Log Horizon pilot episode.", "date": "2017-01-23"}, {"text": "ZZ Gundam started with a goddamn recap episode and didn't actually put you in the series until episode 2", "date": "2017-01-23"}, {"text": "Girls und Panzer\n\nAlthough this is one of my favorite series, the 1st episode is not that exciting except for the first 5 min.\n\nWhen you get into the whole friendship ordeal and some of the SoL parts in that episode, I do admit that it's pretty boring.\n\nBut the ending to that episode is epic too. Overall, ep 1 is meh.", "date": "2017-01-23"}, {"text": "Lucky Star's first episode was pretty terrible, the jokes about how to eat a cornet were so lame.\nWell although it was not as good as Nichijou, it ended being a respectable comedy.", "date": "2017-01-23"}, {"text": "Hand Shakers, but that's too easy, so I'll go with least favourite pilot of an anime I actually like, which would be between KonoSuba s2 or Kiznaiver. Both are great series that I've rated at least 8/10 (or most likely will rate 8/10 in the case of KonoSuba s2), I just felt their first episodes were a tad weak compared to others.", "date": "2017-01-23"}]}, {"title": "What are your favorite anime with romance?", "text": "I personally really enjoyed Your Lie in April and Clannad. ", "date": "2017-01-23", "comments": [{"text": "* [Golden Time](https://myanimelist.net/anime/17895/Golden_Time)\n\n* [Sakurasou no Pet na Kanojo](https://myanimelist.net/anime/13759/Sakurasou_no_Pet_na_Kanojo)\n\n* [My Little Monster](https://myanimelist.net/anime/14227/Tonari_no_Kaibutsu-kun?q=little%20monster)\n\n* [Ore Monogatari!!](https://myanimelist.net/anime/28297/Ore_Monogatari?q=ore)\n\n* [They Are My Noble Masters, Kimiaru](https://myanimelist.net/anime/3229/Kimi_ga_Aruji_de_Shitsuji_ga_Ore_de)\n\nI have plenty more i enjoy that fall under the harem category but it would take forever to list them all.", "date": "2017-01-23"}, {"text": "Toradora ", "date": "2017-01-23"}, {"text": "Kokoro Connect", "date": "2017-01-23"}, {"text": "OreGairu and it will be even better when he finishes ", "date": "2017-01-23"}, {"text": "[Karekano](https://myanimelist.net/anime/145/Kareshi_Kanojo_no_Jijou) is nice.\n\n[Niijiro Days](https://myanimelist.net/anime/31414/Nijiiro_Days) **is the bomb**. Really fun and adorable.\n\n[Momokuri](https://myanimelist.net/anime/30014/Momokuri) manages to be adorable and creepy at the same time.\n\n[Emma: A Victorian Romance](https://myanimelist.net/anime/345/Eikoku_Koi_Monogatari_Emma) is a very tradition but a good one. Not exactly my cup of tea for romance but I do like the general story.\n\n", "date": "2017-01-23"}, {"text": "Favourite anime that has romance in it? Kyoukai no Kanata\n\nFavourite romance anime? Tamako Love Story no doubt.", "date": "2017-01-23"}, {"text": "[White Album 2](https://myanimelist.net/anime/18245/White_Album_2)  \n[Hantsuki](https://myanimelist.net/anime/587/Hanbun_no_Tsuki_ga_Noboru_Sora)  \n[Myself; Yourself](https://myanimelist.net/anime/2926/Myself__Yourself)", "date": "2017-01-23"}, {"text": "+1 for Clannad, that's my favorite.   ", "date": "2017-01-23"}, {"text": "Naruto is pretty dattebayo", "date": "2017-01-23"}, {"text": "Chuunibyou demo Koi ga Shitai", "date": "2017-01-23"}, {"text": "5 Centimetres Per Second", "date": "2017-01-23"}, {"text": "Kimi ga Nozomu Eien.\n\nThis will hurt you.", "date": "2017-01-23"}, {"text": "Steins;Gate.   \nFavorite romance is Clannad AS.", "date": "2017-01-23"}, {"text": "Waiting in the summer ", "date": "2017-01-23"}, {"text": "Spice and Wolf, Crest of the Stars, Cross Game.", "date": "2017-01-23"}, {"text": "Your Lie in April and White Album 2.\n\nAnother romance I loved which is quite unpopular Kimi No Iru Machi.", "date": "2017-01-23"}, {"text": "White Album 2. While I found the romance to be unbelievable and cheesy, the emotions felt real.", "date": "2017-01-23"}, {"text": "[Maison Ikkoku](https://myanimelist.net/anime/1453/Maison_Ikkoku)", "date": "2017-01-23"}, {"text": "[removed]", "date": "2017-01-23"}, {"text": "Maid Sama ", "date": "2017-01-23"}, {"text": "- Angel Beats\n\n- Clannad\n\n- Chuunibyou\n\n- Toradora\n\n- Steins;Gate if that counts", "date": "2017-01-23"}, {"text": "Akagami no Shirayuki-hime", "date": "2017-01-23"}, {"text": "Akagami no Shirayuki-hime, it's such a sweet and pretty show", "date": "2017-01-23"}, {"text": "Toradora! Although, it depends if you consider [AmaBuri to have any romance...](https://www.youtube.com/watch?v=rbXX4EvrdHA) (OVA spoilers)", "date": "2017-01-23"}, {"text": "Lovely Complex is pure romance, well executed as well.  \nBakemonogatari first season  \nSamurai X: Trust and Betrayal  \nOokami to Koushinryou (Spice and wolf) does have some romance and it is sweet but there's no definitive conclusion afaik, I've seen it ages ago", "date": "2017-01-23"}, {"text": "Mayo chiki ", "date": "2017-01-23"}, {"text": "ef - a tale of memories for me.", "date": "2017-01-23"}, {"text": "[Spice and Wolf!](https://myanimelist.net/anime/2966/Ookami_to_Koushinryou)", "date": "2017-01-23"}, {"text": "contains romance? Gurren Lagann or Tatami Galaxy.\n\nromance anime? Toradora.", "date": "2017-01-23"}, {"text": "Bakemonogatari, definitely.", "date": "2017-01-23"}]}, {"title": "What changes would you apply to your favourite anime in order to make it even better?", "text": "[Steins:Gate](/s \"Okabe and Kurisu romance\")", "date": "2017-01-23", "comments": [{"text": "[A second season](https://myanimelist.net/anime/32093/Tanaka-kun_wa_Itsumo_Kedaruge)\n\n[](#cry)", "date": "2017-01-23"}, {"text": "Wait, OP.\n\n[Steins;Gate](/s \"Have you missed the OVA? If so, watch it. Now.\")", "date": "2017-01-23"}, {"text": "More episodes. But really I'd like more Mugi episodes, to get to know her character better. ", "date": "2017-01-23"}, {"text": "Clannad is only about Kyou. Also Fuko never existed", "date": "2017-01-23"}, {"text": "As much as I love Hunter x Hunter, I think if the Chimera Ant Arc is sort of like a flawed masterpiece. What's there is extremely good, but the pacing is questionable and the narrator would do well to shut up and let us see what is going to happen instead of telling us about it. If those issues were fixed, I think it would be nearly perfect.", "date": "2017-01-23"}, {"text": "Since Clannad is taken I'll say a full adaptation of Spice & Wolf so anime can finally be saved once and for all.", "date": "2017-01-23"}, {"text": "[Madoka Magica](/s \"At some point, have a cold open or something that gives a brief flashback of Kyouko and Mami's prior relationship\")", "date": "2017-01-23"}, {"text": "[Gankutsuou](/s \"Apply modern CGI to those duelling armors. Usually I'd say to have it handdrawn, but this show is pretty much all CGI already, so yeah.\")", "date": "2017-01-23"}, {"text": "Arakawa Under the Bridge, add just a little backstory. Especially for Nino.", "date": "2017-01-23"}, {"text": "Remove Nina Einstein completely.", "date": "2017-01-23"}, {"text": "shows can always have higher production value, so that.", "date": "2017-01-23"}, {"text": "I'd fix the writing during the middle of Code Geass R2 somehow.. :'(\nI'd also give Spice & Wolf a season 3.", "date": "2017-01-23"}, {"text": "Favorite Anime: Re: Zero\n\nFavorite Genre: Suffering, fantasy, magical girl\n\n... Well [Re: Zero LN](/s \"I guess all I'd do is make sure they included Rem's fate in that last episode\") because honestly, they included a pretty damn good amount of two my favorite genre already, and I think adding the third would just make it weird.", "date": "2017-01-23"}, {"text": "(Not my favourite anime, but I believe the show had more potential)\nDarker than Black. Change how they handled it, give it a solid story with solid explanations and good pacing. I loved the show the way it is, but I think it could've been more than it currently is.", "date": "2017-01-23"}, {"text": "[Little Busters spoilers](/s \"time resets, more set up for Refrain, more time on the characters rather than plot\")", "date": "2017-01-23"}, {"text": "Put more action in the fights in HxH. If I were to choose between how it is now, with the fights being more strategic/psychological or whatever or removing that and leaving it only action packed, I'd rather leave it as it is, but there is space to put both", "date": "2017-01-23"}, {"text": "Cross Ange: Just have it be backwards", "date": "2017-01-23"}, {"text": "Actually deliver the yuri", "date": "2017-01-23"}, {"text": "I'd love a second season of Darker than Black to tie up all those loose ends left behind by the OVA's and first season.", "date": "2017-01-23"}, {"text": "Death Note is my favourite - it's no secret the second half is inferior, I would probably make it longer (it was about the same length as the first in the manga) and give Near some actual character development. It would probably end up straying from the manga a bit but it'd be worth it. Near sucks, but if we got to see a bit more of what really goes on in his head, show him having interactions with other characters beyond giving orders, maybe he could become somewhat likeable. As it is, he's a Mary Sue with some quirks that feel like they're there for the sake of it. We never get to see him showing genuine emotions or even outside of that little room besides one or two scenes. We're told that he has terrible social skills but we never actually see that, it never has any impact on anything so it's hardly a flaw. We get to see what L is like in all sorts of situations, we see him displaying every emotion from joy to surprise to sheer terror, and it makes him a way more likeable and relatable character. If Near had some of that, and they made an effort to make him stand apart from L instead of being a ripoff, it'd probably make the second half more enjoyable.", "date": "2017-01-23"}, {"text": "I wouldve wished more of Shirou's monologues were present in Fate Stay Night Unlimited Blade Works. He wasn't understood right and the director is at fault", "date": "2017-01-23"}, {"text": "I would change how much Flip Flappers sold.\n\nAccounting for recency bias, I can't change anything in Monogatari. Its perfect through its imperfections.", "date": "2017-01-23"}, {"text": "I really don't think there's anything I could do to make Hyouka better, there's not really a single element I dislike.", "date": "2017-01-23"}]}]